 const province = 	[
    {
        "province": "北京",
        "abbreviate": "京",
        "code": "110000",
        "cities": [
            {
                "name": "东城区",
                "code": "110101"
            },
            {
                "name": "西城区",
                "code": "110102"
            },
            {
                "name": "朝阳区",
                "code": "110105"
            },
            {
                "name": "丰台区",
                "code": "110106"
            },
            {
                "name": "石景山区",
                "code": "110107"
            },
            {
                "name": "海淀区",
                "code": "110108"
            },
            {
                "name": "门头沟区",
                "code": "110109"
            },
            {
                "name": "房山区",
                "code": "110111"
            },
            {
                "name": "通州区",
                "code": "110112"
            },
            {
                "name": "顺义区",
                "code": "110113"
            },
            {
                "name": "昌平区",
                "code": "110114"
            },
            {
                "name": "大兴区",
                "code": "110115"
            },
            {
                "name": "怀柔区",
                "code": "110116"
            },
            {
                "name": "平谷区",
                "code": "110117"
            },
            {
                "name": "密云区",
                "code": "110118"
            },
            {
                "name": "延庆区",
                "code": "110119"
            }
        ]
    },
    {
        "province": "天津",
        "abbreviate": "津",
        "code": "120000",
        "cities": [
            {
                "name": "和平区",
                "code": "120101"
            },
            {
                "name": "河东区",
                "code": "120102"
            },
            {
                "name": "河西区",
                "code": "120103"
            },
            {
                "name": "南开区",
                "code": "120104"
            },
            {
                "name": "河北区",
                "code": "120105"
            },
            {
                "name": "红桥区",
                "code": "120106"
            },
            {
                "name": "东丽区",
                "code": "120110"
            },
            {
                "name": "西青区",
                "code": "120111"
            },
            {
                "name": "津南区",
                "code": "120112"
            },
            {
                "name": "北辰区",
                "code": "120113"
            },
            {
                "name": "武清区",
                "code": "120114"
            },
            {
                "name": "宝坻区",
                "code": "120115"
            },
            {
                "name": "滨海新区",
                "code": "120116"
            },
            {
                "name": "宁河区",
                "code": "120117"
            },
            {
                "name": "静海区",
                "code": "120118"
            },
            {
                "name": "蓟州区",
                "code": "120119"
            }
        ]
    },
    {
        "province": "河北",
        "abbreviate": "冀",
        "code": "130000",
        "cities": [
            {
                "name": "石家庄",
                "code": "130100"
            },
            {
                "name": "唐山",
                "code": "130200"
            },
            {
                "name": "秦皇岛",
                "code": "130300"
            },
            {
                "name": "邯郸",
                "code": "130400"
            },
            {
                "name": "邢台",
                "code": "130500"
            },
            {
                "name": "保定",
                "code": "130600"
            },
            {
                "name": "张家口",
                "code": "130700"
            },
            {
                "name": "承德",
                "code": "130800"
            },
            {
                "name": "沧州",
                "code": "130900"
            },
            {
                "name": "廊坊",
                "code": "131000"
            },
            {
                "name": "衡水",
                "code": "131100"
            }
        ]
    },
    {
        "province": "山西",
        "abbreviate": "晋",
        "code": "140000",
        "cities": [
            {
                "name": "太原",
                "code": "140100"
            },
            {
                "name": "大同",
                "code": "140200"
            },
            {
                "name": "阳泉",
                "code": "140300"
            },
            {
                "name": "长治",
                "code": "140400"
            },
            {
                "name": "晋城",
                "code": "140500"
            },
            {
                "name": "朔州",
                "code": "140600"
            },
            {
                "name": "晋中",
                "code": "140700"
            },
            {
                "name": "运城",
                "code": "140800"
            },
            {
                "name": "忻州",
                "code": "140900"
            },
            {
                "name": "临汾",
                "code": "141000"
            },
            {
                "name": "吕梁",
                "code": "141100"
            }
        ]
    },
    {
        "province": "内蒙古",
        "abbreviate": "蒙",
        "code": "150000",
        "cities": [
            {
                "name": "呼和浩特",
                "code": "150100"
            },
            {
                "name": "包头",
                "code": "150200"
            },
            {
                "name": "乌海",
                "code": "150300"
            },
            {
                "name": "赤峰",
                "code": "150400"
            },
            {
                "name": "通辽",
                "code": "150500"
            },
            {
                "name": "鄂尔多斯",
                "code": "150600"
            },
            {
                "name": "呼伦贝尔",
                "code": "150700"
            },
            {
                "name": "巴彦淖尔",
                "code": "150800"
            },
            {
                "name": "乌兰察布",
                "code": "150900"
            },
            {
                "name": "兴安盟",
                "code": "152200"
            },
            {
                "name": "锡林郭勒盟",
                "code": "152500"
            },
            {
                "name": "阿拉善盟",
                "code": "152900"
            }
        ]
    },
    {
        "province": "辽宁",
        "abbreviate": "辽",
        "code": "210000",
        "cities": [
            {
                "name": "沈阳",
                "code": "210100"
            },
            {
                "name": "大连",
                "code": "210200"
            },
            {
                "name": "鞍山",
                "code": "210300"
            },
            {
                "name": "抚顺",
                "code": "210400"
            },
            {
                "name": "本溪",
                "code": "210500"
            },
            {
                "name": "丹东",
                "code": "210600"
            },
            {
                "name": "锦州",
                "code": "210700"
            },
            {
                "name": "营口",
                "code": "210800"
            },
            {
                "name": "阜新",
                "code": "210900"
            },
            {
                "name": "辽阳",
                "code": "211000"
            },
            {
                "name": "盘锦",
                "code": "211100"
            },
            {
                "name": "铁岭",
                "code": "211200"
            },
            {
                "name": "朝阳",
                "code": "211300"
            },
            {
                "name": "葫芦岛",
                "code": "211400"
            }
        ]
    },
    {
        "province": "吉林",
        "abbreviate": "吉",
        "code": "220000",
        "cities": [
            {
                "name": "长春",
                "code": "220100"
            },
            {
                "name": "吉林",
                "code": "220200"
            },
            {
                "name": "四平",
                "code": "220300"
            },
            {
                "name": "辽源",
                "code": "220400"
            },
            {
                "name": "通化",
                "code": "220500"
            },
            {
                "name": "白山",
                "code": "220600"
            },
            {
                "name": "松原",
                "code": "220700"
            },
            {
                "name": "白城",
                "code": "220800"
            },
            {
                "name": "延边朝鲜族自治州",
                "code": "222400"
            }
        ]
    },
    {
        "province": "黑龙江",
        "abbreviate": "黑",
        "code": "230000",
        "cities": [
            {
                "name": "哈尔滨",
                "code": "230100"
            },
            {
                "name": "齐齐哈尔",
                "code": "230200"
            },
            {
                "name": "鸡西",
                "code": "230300"
            },
            {
                "name": "鹤岗",
                "code": "230400"
            },
            {
                "name": "双鸭山",
                "code": "230500"
            },
            {
                "name": "大庆",
                "code": "230600"
            },
            {
                "name": "伊春",
                "code": "230700"
            },
            {
                "name": "佳木斯",
                "code": "230800"
            },
            {
                "name": "七台河",
                "code": "230900"
            },
            {
                "name": "牡丹江",
                "code": "231000"
            },
            {
                "name": "黑河",
                "code": "231100"
            },
            {
                "name": "绥化",
                "code": "231200"
            },
            {
                "name": "大兴安岭地区",
                "code": "232700"
            }
        ]
    },
    {
        "province": "上海",
        "abbreviate": "沪",
        "code": "310000",
        "cities": [
            {
                "name": "黄浦区",
                "code": "310101"
            },
            {
                "name": "徐汇区",
                "code": "310104"
            },
            {
                "name": "长宁区",
                "code": "310105"
            },
            {
                "name": "静安区",
                "code": "310106"
            },
            {
                "name": "普陀区",
                "code": "310107"
            },
            {
                "name": "虹口区",
                "code": "310109"
            },
            {
                "name": "杨浦区",
                "code": "310110"
            },
            {
                "name": "闵行区",
                "code": "310112"
            },
            {
                "name": "宝山区",
                "code": "310113"
            },
            {
                "name": "嘉定区",
                "code": "310114"
            },
            {
                "name": "浦东新区",
                "code": "310115"
            },
            {
                "name": "金山区",
                "code": "310116"
            },
            {
                "name": "松江区",
                "code": "310117"
            },
            {
                "name": "青浦区",
                "code": "310118"
            },
            {
                "name": "奉贤区",
                "code": "310120"
            },
            {
                "name": "崇明区",
                "code": "310151"
            }
        ]
    },
    {
        "province": "江苏",
        "abbreviate": "苏",
        "code": "320000",
        "cities": [
            {
                "name": "南京",
                "code": "320100"
            },
            {
                "name": "无锡",
                "code": "320200"
            },
            {
                "name": "徐州",
                "code": "320300"
            },
            {
                "name": "常州",
                "code": "320400"
            },
            {
                "name": "苏州",
                "code": "320500"
            },
            {
                "name": "南通",
                "code": "320600"
            },
            {
                "name": "连云港",
                "code": "320700"
            },
            {
                "name": "淮安",
                "code": "320800"
            },
            {
                "name": "盐城",
                "code": "320900"
            },
            {
                "name": "扬州",
                "code": "321000"
            },
            {
                "name": "镇江",
                "code": "321100"
            },
            {
                "name": "泰州",
                "code": "321200"
            },
            {
                "name": "宿迁",
                "code": "321300"
            }
        ]
    },
    {
        "province": "浙江",
        "abbreviate": "浙",
        "code": "330000",
        "cities": [
            {
                "name": "杭州",
                "code": "330100"
            },
            {
                "name": "宁波",
                "code": "330200"
            },
            {
                "name": "温州",
                "code": "330300"
            },
            {
                "name": "嘉兴",
                "code": "330400"
            },
            {
                "name": "湖州",
                "code": "330500"
            },
            {
                "name": "绍兴",
                "code": "330600"
            },
            {
                "name": "金华",
                "code": "330700"
            },
            {
                "name": "衢州",
                "code": "330800"
            },
            {
                "name": "舟山",
                "code": "330900"
            },
            {
                "name": "台州",
                "code": "331000"
            },
            {
                "name": "丽水",
                "code": "331100"
            }
        ]
    },
    {
        "province": "安徽",
        "abbreviate": "皖",
        "code": "340000",
        "cities": [
            {
                "name": "合肥",
                "code": "340100"
            },
            {
                "name": "芜湖",
                "code": "340200"
            },
            {
                "name": "蚌埠",
                "code": "340300"
            },
            {
                "name": "淮南",
                "code": "340400"
            },
            {
                "name": "马鞍山",
                "code": "340500"
            },
            {
                "name": "淮北",
                "code": "340600"
            },
            {
                "name": "铜陵",
                "code": "340700"
            },
            {
                "name": "安庆",
                "code": "340800"
            },
            {
                "name": "黄山",
                "code": "341000"
            },
            {
                "name": "滁州",
                "code": "341100"
            },
            {
                "name": "阜阳",
                "code": "341200"
            },
            {
                "name": "宿州",
                "code": "341300"
            },
            {
                "name": "六安",
                "code": "341500"
            },
            {
                "name": "亳州",
                "code": "341600"
            },
            {
                "name": "池州",
                "code": "341700"
            },
            {
                "name": "宣城",
                "code": "341800"
            }
        ]
    },
    {
        "province": "福建",
        "abbreviate": "闽",
        "code": "350000",
        "cities": [
            {
                "name": "福州",
                "code": "350100"
            },
            {
                "name": "厦门",
                "code": "350200"
            },
            {
                "name": "莆田",
                "code": "350300"
            },
            {
                "name": "三明",
                "code": "350400"
            },
            {
                "name": "泉州",
                "code": "350500"
            },
            {
                "name": "漳州",
                "code": "350600"
            },
            {
                "name": "南平",
                "code": "350700"
            },
            {
                "name": "龙岩",
                "code": "350800"
            },
            {
                "name": "宁德",
                "code": "350900"
            }
        ]
    },
    {
        "province": "江西",
        "abbreviate": "赣",
        "code": "360000",
        "cities": [
            {
                "name": "南昌",
                "code": "360100"
            },
            {
                "name": "景德镇",
                "code": "360200"
            },
            {
                "name": "萍乡",
                "code": "360300"
            },
            {
                "name": "九江",
                "code": "360400"
            },
            {
                "name": "新余",
                "code": "360500"
            },
            {
                "name": "鹰潭",
                "code": "360600"
            },
            {
                "name": "赣州",
                "code": "360700"
            },
            {
                "name": "吉安",
                "code": "360800"
            },
            {
                "name": "宜春",
                "code": "360900"
            },
            {
                "name": "抚州",
                "code": "361000"
            },
            {
                "name": "上饶",
                "code": "361100"
            }
        ]
    },
    {
        "province": "山东",
        "abbreviate": "鲁",
        "code": "370000",
        "cities": [
            {
                "name": "济南",
                "code": "370100"
            },
            {
                "name": "青岛",
                "code": "370200"
            },
            {
                "name": "淄博",
                "code": "370300"
            },
            {
                "name": "枣庄",
                "code": "370400"
            },
            {
                "name": "东营",
                "code": "370500"
            },
            {
                "name": "烟台",
                "code": "370600"
            },
            {
                "name": "潍坊",
                "code": "370700"
            },
            {
                "name": "济宁",
                "code": "370800"
            },
            {
                "name": "泰安",
                "code": "370900"
            },
            {
                "name": "威海",
                "code": "371000"
            },
            {
                "name": "日照",
                "code": "371100"
            },
            {
                "name": "临沂",
                "code": "371300"
            },
            {
                "name": "德州",
                "code": "371400"
            },
            {
                "name": "聊城",
                "code": "371500"
            },
            {
                "name": "滨州",
                "code": "371600"
            },
            {
                "name": "菏泽",
                "code": "371700"
            }
        ]
    },
    {
        "province": "河南",
        "abbreviate": "豫",
        "code": "410000",
        "cities": [
            {
                "name": "郑州",
                "code": "410100"
            },
            {
                "name": "开封",
                "code": "410200"
            },
            {
                "name": "洛阳",
                "code": "410300"
            },
            {
                "name": "平顶山",
                "code": "410400"
            },
            {
                "name": "安阳",
                "code": "410500"
            },
            {
                "name": "鹤壁",
                "code": "410600"
            },
            {
                "name": "新乡",
                "code": "410700"
            },
            {
                "name": "焦作",
                "code": "410800"
            },
            {
                "name": "濮阳",
                "code": "410900"
            },
            {
                "name": "许昌",
                "code": "411000"
            },
            {
                "name": "漯河",
                "code": "411100"
            },
            {
                "name": "三门峡",
                "code": "411200"
            },
            {
                "name": "南阳",
                "code": "411300"
            },
            {
                "name": "商丘",
                "code": "411400"
            },
            {
                "name": "信阳",
                "code": "411500"
            },
            {
                "name": "周口",
                "code": "411600"
            },
            {
                "name": "驻马店",
                "code": "411700"
            }
        ]
    },
    {
        "province": "湖北",
        "abbreviate": "鄂",
        "code": "420000",
        "cities": [
            {
                "name": "武汉",
                "code": "420100"
            },
            {
                "name": "黄石",
                "code": "420200"
            },
            {
                "name": "十堰",
                "code": "420300"
            },
            {
                "name": "宜昌",
                "code": "420500"
            },
            {
                "name": "襄阳",
                "code": "420600"
            },
            {
                "name": "鄂州",
                "code": "420700"
            },
            {
                "name": "荆门",
                "code": "420800"
            },
            {
                "name": "孝感",
                "code": "420900"
            },
            {
                "name": "荆州",
                "code": "421000"
            },
            {
                "name": "黄冈",
                "code": "421100"
            },
            {
                "name": "咸宁",
                "code": "421200"
            },
            {
                "name": "随州",
                "code": "421300"
            },
            {
                "name": "恩施土家族苗族自治州",
                "code": "422800"
            }
        ]
    },
    {
        "province": "湖南",
        "abbreviate": "湘",
        "code": "430000",
        "cities": [
            {
                "name": "长沙",
                "code": "430100"
            },
            {
                "name": "株洲",
                "code": "430200"
            },
            {
                "name": "湘潭",
                "code": "430300"
            },
            {
                "name": "衡阳",
                "code": "430400"
            },
            {
                "name": "邵阳",
                "code": "430500"
            },
            {
                "name": "岳阳",
                "code": "430600"
            },
            {
                "name": "常德",
                "code": "430700"
            },
            {
                "name": "张家界",
                "code": "430800"
            },
            {
                "name": "益阳",
                "code": "430900"
            },
            {
                "name": "郴州",
                "code": "431000"
            },
            {
                "name": "永州",
                "code": "431100"
            },
            {
                "name": "怀化",
                "code": "431200"
            },
            {
                "name": "娄底",
                "code": "431300"
            },
            {
                "name": "湘西土家族苗族自治州",
                "code": "433100"
            }
        ]
    },
    {
        "province": "广东",
        "abbreviate": "粤",
        "code": "440000",
        "cities": [
            {
                "name": "广州",
                "code": "440100"
            },
            {
                "name": "韶关",
                "code": "440200"
            },
            {
                "name": "深圳",
                "code": "440300"
            },
            {
                "name": "珠海",
                "code": "440400"
            },
            {
                "name": "汕头",
                "code": "440500"
            },
            {
                "name": "佛山",
                "code": "440600"
            },
            {
                "name": "江门",
                "code": "440700"
            },
            {
                "name": "湛江",
                "code": "440800"
            },
            {
                "name": "茂名",
                "code": "440900"
            },
            {
                "name": "肇庆",
                "code": "441200"
            },
            {
                "name": "惠州",
                "code": "441300"
            },
            {
                "name": "梅州",
                "code": "441400"
            },
            {
                "name": "汕尾",
                "code": "441500"
            },
            {
                "name": "河源",
                "code": "441600"
            },
            {
                "name": "阳江",
                "code": "441700"
            },
            {
                "name": "清远",
                "code": "441800"
            },
            {
                "name": "东莞",
                "code": "441900"
            },
            {
                "name": "中山",
                "code": "442000"
            },
            {
                "name": "潮州",
                "code": "445100"
            },
            {
                "name": "揭阳",
                "code": "445200"
            },
            {
                "name": "云浮",
                "code": "445300"
            }
        ]
    },
    {
        "province": "广西",
        "abbreviate": "桂",
        "code": "450000",
        "cities": [
            {
                "name": "南宁",
                "code": "450100"
            },
            {
                "name": "柳州",
                "code": "450200"
            },
            {
                "name": "桂林",
                "code": "450300"
            },
            {
                "name": "梧州",
                "code": "450400"
            },
            {
                "name": "北海",
                "code": "450500"
            },
            {
                "name": "防城港",
                "code": "450600"
            },
            {
                "name": "钦州",
                "code": "450700"
            },
            {
                "name": "贵港",
                "code": "450800"
            },
            {
                "name": "玉林",
                "code": "450900"
            },
            {
                "name": "百色",
                "code": "451000"
            },
            {
                "name": "贺州",
                "code": "451100"
            },
            {
                "name": "河池",
                "code": "451200"
            },
            {
                "name": "来宾",
                "code": "451300"
            },
            {
                "name": "崇左",
                "code": "451400"
            }
        ]
    },
    {
        "province": "海南",
        "abbreviate": "琼",
        "code": "460000",
        "cities": [
            {
                "name": "海口",
                "code": "460100"
            },
            {
                "name": "三亚",
                "code": "460200"
            },
            {
                "name": "三沙",
                "code": "460300"
            },
            {
                "name": "儋州",
                "code": "460400"
            }
        ]
    },
    {
        "province": "重庆",
        "abbreviate": "渝",
        "code": "500000",
        "cities": [
            {
                "name": "万州区",
                "code": "500101"
            },
            {
                "name": "涪陵区",
                "code": "500102"
            },
            {
                "name": "渝中区",
                "code": "500103"
            },
            {
                "name": "大渡口区",
                "code": "500104"
            },
            {
                "name": "江北区",
                "code": "500105"
            },
            {
                "name": "沙坪坝区",
                "code": "500106"
            },
            {
                "name": "九龙坡区",
                "code": "500107"
            },
            {
                "name": "南岸区",
                "code": "500108"
            },
            {
                "name": "北碚区",
                "code": "500109"
            },
            {
                "name": "綦江区",
                "code": "500110"
            },
            {
                "name": "大足区",
                "code": "500111"
            },
            {
                "name": "渝北区",
                "code": "500112"
            },
            {
                "name": "巴南区",
                "code": "500113"
            },
            {
                "name": "黔江区",
                "code": "500114"
            },
            {
                "name": "长寿区",
                "code": "500115"
            },
            {
                "name": "江津区",
                "code": "500116"
            },
            {
                "name": "合川区",
                "code": "500117"
            },
            {
                "name": "永川区",
                "code": "500118"
            },
            {
                "name": "南川区",
                "code": "500119"
            },
            {
                "name": "璧山区",
                "code": "500120"
            },
            {
                "name": "铜梁区",
                "code": "500151"
            },
            {
                "name": "潼南区",
                "code": "500152"
            },
            {
                "name": "荣昌区",
                "code": "500153"
            },
            {
                "name": "开州区",
                "code": "500154"
            },
            {
                "name": "梁平区",
                "code": "500155"
            },
            {
                "name": "武隆区",
                "code": "500156"
            },
            {
                "name": "城口县",
                "code": "500229"
            },
            {
                "name": "丰都县",
                "code": "500230"
            },
            {
                "name": "垫江县",
                "code": "500231"
            },
            {
                "name": "忠县",
                "code": "500233"
            },
            {
                "name": "云阳县",
                "code": "500235"
            },
            {
                "name": "奉节县",
                "code": "500236"
            },
            {
                "name": "巫山县",
                "code": "500237"
            },
            {
                "name": "巫溪县",
                "code": "500238"
            },
            {
                "name": "石柱土家族自治县",
                "code": "500240"
            },
            {
                "name": "秀山土家族苗族自治县",
                "code": "500241"
            },
            {
                "name": "酉阳土家族苗族自治县",
                "code": "500242"
            },
            {
                "name": "彭水苗族土家族自治县",
                "code": "500243"
            }
        ]
    },
    {
        "province": "四川",
        "abbreviate": "川",
        "code": "510000",
        "cities": [
            {
                "name": "成都",
                "code": "510100"
            },
            {
                "name": "自贡",
                "code": "510300"
            },
            {
                "name": "攀枝花",
                "code": "510400"
            },
            {
                "name": "泸州",
                "code": "510500"
            },
            {
                "name": "德阳",
                "code": "510600"
            },
            {
                "name": "绵阳",
                "code": "510700"
            },
            {
                "name": "广元",
                "code": "510800"
            },
            {
                "name": "遂宁",
                "code": "510900"
            },
            {
                "name": "内江",
                "code": "511000"
            },
            {
                "name": "乐山",
                "code": "511100"
            },
            {
                "name": "南充",
                "code": "511300"
            },
            {
                "name": "眉山",
                "code": "511400"
            },
            {
                "name": "宜宾",
                "code": "511500"
            },
            {
                "name": "广安",
                "code": "511600"
            },
            {
                "name": "达州",
                "code": "511700"
            },
            {
                "name": "雅安",
                "code": "511800"
            },
            {
                "name": "巴中",
                "code": "511900"
            },
            {
                "name": "资阳",
                "code": "512000"
            },
            {
                "name": "阿坝藏族羌族自治州",
                "code": "513200"
            },
            {
                "name": "甘孜藏族自治州",
                "code": "513300"
            },
            {
                "name": "凉山彝族自治州",
                "code": "513400"
            }
        ]
    },
    {
        "province": "贵州",
        "abbreviate": "贵",
        "code": "520000",
        "cities": [
            {
                "name": "贵阳",
                "code": "520100"
            },
            {
                "name": "六盘水",
                "code": "520200"
            },
            {
                "name": "遵义",
                "code": "520300"
            },
            {
                "name": "安顺",
                "code": "520400"
            },
            {
                "name": "毕节",
                "code": "520500"
            },
            {
                "name": "铜仁",
                "code": "520600"
            },
            {
                "name": "黔西南布依族苗族自治州",
                "code": "522300"
            },
            {
                "name": "黔东南苗族侗族自治州",
                "code": "522600"
            },
            {
                "name": "黔南布依族苗族自治州",
                "code": "522700"
            }
        ]
    },
    {
        "province": "云南",
        "abbreviate": "云",
        "code": "530000",
        "cities": [
            {
                "name": "昆明",
                "code": "530100"
            },
            {
                "name": "曲靖",
                "code": "530300"
            },
            {
                "name": "玉溪",
                "code": "530400"
            },
            {
                "name": "保山",
                "code": "530500"
            },
            {
                "name": "昭通",
                "code": "530600"
            },
            {
                "name": "丽江",
                "code": "530700"
            },
            {
                "name": "普洱",
                "code": "530800"
            },
            {
                "name": "临沧",
                "code": "530900"
            },
            {
                "name": "楚雄彝族自治州",
                "code": "532300"
            },
            {
                "name": "红河哈尼族彝族自治州",
                "code": "532500"
            },
            {
                "name": "文山壮族苗族自治州",
                "code": "532600"
            },
            {
                "name": "西双版纳傣族自治州",
                "code": "532800"
            },
            {
                "name": "大理白族自治州",
                "code": "532900"
            },
            {
                "name": "德宏傣族景颇族自治州",
                "code": "533100"
            },
            {
                "name": "怒江傈僳族自治州",
                "code": "533300"
            },
            {
                "name": "迪庆藏族自治州",
                "code": "533400"
            }
        ]
    },
    {
        "province": "西藏",
        "abbreviate": "藏",
        "code": "540000",
        "cities": [
            {
                "name": "拉萨",
                "code": "540100"
            },
            {
                "name": "日喀则",
                "code": "540200"
            },
            {
                "name": "昌都",
                "code": "540300"
            },
            {
                "name": "林芝",
                "code": "540400"
            },
            {
                "name": "山南",
                "code": "540500"
            },
            {
                "name": "那曲",
                "code": "540600"
            },
            {
                "name": "阿里地区",
                "code": "542500"
            }
        ]
    },
    {
        "province": "陕西",
        "abbreviate": "陕",
        "code": "610000",
        "cities": [
            {
                "name": "西安",
                "code": "610100"
            },
            {
                "name": "铜川",
                "code": "610200"
            },
            {
                "name": "宝鸡",
                "code": "610300"
            },
            {
                "name": "咸阳",
                "code": "610400"
            },
            {
                "name": "渭南",
                "code": "610500"
            },
            {
                "name": "延安",
                "code": "610600"
            },
            {
                "name": "汉中",
                "code": "610700"
            },
            {
                "name": "榆林",
                "code": "610800"
            },
            {
                "name": "安康",
                "code": "610900"
            },
            {
                "name": "商洛",
                "code": "611000"
            }
        ]
    },
    {
        "province": "甘肃",
        "abbreviate": "甘",
        "code": "620000",
        "cities": [
            {
                "name": "兰州",
                "code": "620100"
            },
            {
                "name": "嘉峪关",
                "code": "620200"
            },
            {
                "name": "金昌",
                "code": "620300"
            },
            {
                "name": "白银",
                "code": "620400"
            },
            {
                "name": "天水",
                "code": "620500"
            },
            {
                "name": "武威",
                "code": "620600"
            },
            {
                "name": "张掖",
                "code": "620700"
            },
            {
                "name": "平凉",
                "code": "620800"
            },
            {
                "name": "酒泉",
                "code": "620900"
            },
            {
                "name": "庆阳",
                "code": "621000"
            },
            {
                "name": "定西",
                "code": "621100"
            },
            {
                "name": "陇南",
                "code": "621200"
            },
            {
                "name": "临夏回族自治州",
                "code": "622900"
            },
            {
                "name": "甘南藏族自治州",
                "code": "623000"
            }
        ]
    },
    {
        "province": "青海",
        "abbreviate": "青",
        "code": "630000",
        "cities": [
            {
                "name": "西宁",
                "code": "630100"
            },
            {
                "name": "海东",
                "code": "630200"
            },
            {
                "name": "海北藏族自治州",
                "code": "632200"
            },
            {
                "name": "黄南藏族自治州",
                "code": "632300"
            },
            {
                "name": "海南藏族自治州",
                "code": "632500"
            },
            {
                "name": "果洛藏族自治州",
                "code": "632600"
            },
            {
                "name": "玉树藏族自治州",
                "code": "632700"
            },
            {
                "name": "海西蒙古族藏族自治州",
                "code": "632800"
            }
        ]
    },
    {
        "province": "宁夏",
        "abbreviate": "宁",
        "code": "640000",
        "cities": [
            {
                "name": "银川",
                "code": "640100"
            },
            {
                "name": "石嘴山",
                "code": "640200"
            },
            {
                "name": "吴忠",
                "code": "640300"
            },
            {
                "name": "固原",
                "code": "640400"
            },
            {
                "name": "中卫",
                "code": "640500"
            }
        ]
    },
    {
        "province": "新疆",
        "abbreviate": "新",
        "code": "650000",
        "cities": [
            {
                "name": "乌鲁木齐",
                "code": "650100"
            },
            {
                "name": "克拉玛依",
                "code": "650200"
            },
            {
                "name": "吐鲁番",
                "code": "650400"
            },
            {
                "name": "哈密",
                "code": "650500"
            },
            {
                "name": "昌吉回族自治州",
                "code": "652300"
            },
            {
                "name": "博尔塔拉蒙古自治州",
                "code": "652700"
            },
            {
                "name": "巴音郭楞蒙古自治州",
                "code": "652800"
            },
            {
                "name": "阿克苏地区",
                "code": "652900"
            },
            {
                "name": "克孜勒苏柯尔克孜自治州",
                "code": "653000"
            },
            {
                "name": "喀什地区",
                "code": "653100"
            },
            {
                "name": "和田地区",
                "code": "653200"
            },
            {
                "name": "伊犁哈萨克自治州",
                "code": "654000"
            },
            {
                "name": "塔城地区",
                "code": "654200"
            },
            {
                "name": "阿勒泰地区",
                "code": "654300"
            }
        ]
    },
    {
        "province": "台湾",
        "abbreviate": "台",
        "code": "710000",
        "cities": [
            {
                "name": "新北",
                "code": ""
            },
            {
                "name": "高雄",
                "code": ""
            },
            {
                "name": "台中",
                "code": ""
            },
            {
                "name": "台北",
                "code": ""
            },
            {
                "name": "桃园",
                "code": ""
            },
            {
                "name": "台南",
                "code": ""
            },
            {
                "name": "基隆",
                "code": ""
            },
            {
                "name": "新竹",
                "code": ""
            },
            {
                "name": "嘉义",
                "code": ""
            },
            {
                "name": "新竹县",
                "code": ""
            },
            {
                "name": "苗栗县",
                "code": ""
            },
            {
                "name": "彰化县",
                "code": ""
            },
            {
                "name": "南投县",
                "code": ""
            },
            {
                "name": "云林县",
                "code": ""
            },
            {
                "name": "嘉义县",
                "code": ""
            },
            {
                "name": "屏东县",
                "code": ""
            },
            {
                "name": "宜兰县",
                "code": ""
            },
            {
                "name": "花莲县",
                "code": ""
            },
            {
                "name": "台东县",
                "code": ""
            },
            {
                "name": "澎湖县",
                "code": ""
            }
        ]
    },
    {
        "province": "香港",
        "abbreviate": "港",
        "code": "810000",
        "cities": [
            {
                "name": "香港岛",
                "code": ""
            },
            {
                "name": "九龙",
                "code": ""
            },
            {
                "name": "新界",
                "code": ""
            }
        ]
    },
    {
        "province": "澳门",
        "abbreviate": "澳",
        "code": "820000",
        "cities": [
            {
                "name": "澳门半岛",
                "code": ""
            },
            {
                "name": "澳门离岛",
                "code": ""
            }
        ]
    }
]
export default province
